[
  {
    "id": "christopher_fujino",
    "name": "Christopher Fujino",
    "title": "Software Engineer",
    "company": "Google",
    "social": {
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Ask anything about Flutter!",
      "description": "Ask anything about Flutter from a Flutter team member",
      "lightening": false
    },
    "bio": "Christopher is Flutter team member."
  },
  {
    "id": "kate_lovett",
    "name": "Kate Lovett",
    "title": "Software Engineer",
    "company": "Google",
    "social": {
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "SnackBar Delivery: Unpacking the ScaffoldMessenger",
      "description": "Learn about the ScaffoldMessenger widget, and how to use it in your application so your SnackBars can take flight.",
      "lightening": false
    },
    "bio": "Kate is Flutter and Dart team member."
  },
  {
    "id": "brian_egan",
    "name": "Brian Egan",
    "title": "",
    "company": "",
    "social": {
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Let's Live Code a Checkbox Widget!",
      "description": "Are you getting started with Flutter? Join Brian for a pragmatic introduction to creating your own Widgets! We’ll live code a Checkbox widget starting from scratch, discussing core concepts such as layouts, animations, callback functions, and Stateful Widgets. There’s a lot to learn from a humble Checkbox!",
      "lightening": false
    },
    "bio": "Brian Egan is a Montana boy living in Berlin, Germany. He previously worked on popular web and Android applications for SoundCloud and Zappos. He now spends his time writing open source Dart code, developing his business, and scuba diving as often as possible. He is the author of and contributor to several Dart libraries, including RxDart, redux, flutter_redux, and flutter_architecture_samples."
  },
  {
    "id": "pooja_bhaumik",
    "name": "Pooja Bhaumik",
    "title": "Google Developer Expert for Flutter, Technical Blogger & Public Speaker and Senior Engineer in Bounce",
    "company": "Bounceshare",
    "social": {
      "twitter": "https://twitter.com/pblead26",
      "github": "https://github.com/PoojaB26",
      "linkedin": ""
    },
    "talk": {
      "title": "Widget Testing for Dummies",
      "description": "Do you test your code?  Let's get straight to the point. If you are someone who shies away on this question,  you are not a bad developer. You are just someone who hasn't given testing the attention it needs.And this talk won't be about how amazing testing is, or how many categories of testing is provided by the Flutter framework. <br/> You would know that from this as well https://flutter.dev/docs/testing.But this talk is just about Widget Testing, because it's special to Flutter. And if everything is a widget, everything SHOULD be tested. And I want to dig deeper into this.",
      "lightening": false
    },
    "bio": "Pooja Bhaumik, an early Flutter adopter turned into Google Developer Expert for Flutter, who loves to share her knowledge through blog posts, public speaking, Youtube videos, and open source contributions. Also a Sr. Engineer in Bounce, she is building the next best solutions for mobility in India. She is also passionate about diversity & inclusion and has started a couple of communities, the current one being WomenDroid in Bengaluru, to support personal & professional growth objectives for women developers."
  },
  {
    "id": "felix_angelov",
    "name": "Felix Angelov",
    "title": "Software engineer",
    "company": "very good ventures",
    "social": {
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Cubit and beyond! live coding session",
      "description": "",
      "lightening": false
    },
    "bio": "Software engineer by day, software engineer by night. very good ventures. creator of the bloc library."
  },
  {
    "id": "danielle_cox",
    "name": "Danielle Cox",
    "title": "Software Engineer",
    "company": "flutterista",
    "social": {
      "twitter": "https://twitter.com/imafiguresk8r",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "The importance of diversity",
      "description": "TBA",
      "lightening": false
    },
    "bio": "@Flutterdev advocate and developer who currently pays the bills with android and php.  #flutterista #flutterfly I am not associated with Google."
  },
  {
    "id": "simon_lightfoot",
    "name": "Simon Lightfoot",
    "title": "FlutterWhisperer",
    "company": "FlutterLondon",
    "social": {
      "twitter": "https://twitter.com/devangelslondon",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "State Restoration",
      "description": "Simon explains the new State Restoration API. Why its required.. How it works and more importantly how you can use it to allow your application to have its state long-lived after the application is closed or killed by the Operating System.",
      "lightening": false
    },
    "bio": "Simon loves Flutter and believes its the future of Mobile development. Co-founder Flutter Study Group on Slack, HumpdayQandA and Flutter Community Lead. He's been writing code for 18+ years, of which the last 10 years has been professional Android development. He discovered Flutter in Oct 2017 and since then has not looked back."
  },
  {
    "id": "mais_alheraki",
    "name": "Mais Alheraki",
    "title": "",
    "company": "",
    "social": {
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "FlutterFire: Query Like a Hero",
      "description": "Flutter and Firebase are a perfect combination to make modern reactive apps, and FlutterFire is the client SDKs that help us make the most out of Firebase in Flutter. This talk will go through some important tips on querying data from Firestore inside a Flutter app.",
      "lightening": false
    },
    "bio": ""
  },
  {
    "id": "miguel_beltran",
    "name": "Miguel Beltran",
    "title": "Freelance Flutter Developer",
    "company": "",
    "social": {
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Testing Everything in Flutter",
      "description": "One of the best things about the Flutter developer experience is writing tests. Traditionally, testing in native platforms has been a tedious task which teams left to do, but with Flutter, writing automated tests that verify the logic of your app is a breeze. In this talk, you will learn how to write effective Unit and Widget tests. I will give you an introduction to testing, what mocks and fakes are and how to use them, the tools that Dart provides us for testing and how to cover with tests your application logic and widgets in Flutter. You will also learn what “driver tests” are and when to use them. This talk is intended for developers that are familiar with Flutter but are not yet familiar with testing. After this talk, you and your team will become more effective developers by writing tests and code that will withstand the “test” of time.",
      "lightening": false
    },
    "bio": "Miguel is a freelance developer based in Berlin, experienced in mobile development both on native and cross-platform apps. He currently co-runs a podcast called Code Cafeteria and you can find him sketchnoting at tech conferences."
  },
  {
    "id": "kamal_shree",
    "name": "kamal shree S",
    "title": "",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/whatsupcoders",
      "github": "https://github.com/whatsupcoders",
      "linkedin": ""
    },
    "talk": {
      "title": "Making best use of Dart DevTools",
      "description": "In this session you will get an overview of what's new in Dart DevTools for debugging and performance tools for Dart and Flutter, including demos and take a closer look at everything new - along with tips and tricks for getting the most out of them! Ranging from inspecting your layout to analyzing your app performance view and inbuilt debugger. Also, this session will take you through a variety of steps that can help increase your productivity.",
      "lightening": true
    },
    "bio": "Google Developer Expert in Flutter and Dart with 11 years of experience in Web Technologies, Android and Flutter. I have worked for multinational firms in India, the Netherlands and US.I am an active Youtuber(whatsupcoders) and international speaker with my talks featured in Chicago Meetup,        Devfest Michigan, Droidcon Toronto, KolkataKreate,360AnDev,byteconf-flutter, FemTech, NDC Sydney and various Women TechMakers events globally."
  },
  {
    "id": "lukas_klingsbo",
    "name": "Lukas Klingsbo",
    "title": "Flutter Developer",
    "company": "MindLevel AB",
    "social": {
      "twitter": "https://twitter.com/spyd0n",
      "github": "https://github.com/spydon/",
      "linkedin": "https://www.linkedin.com/in/spydon/"
    },
    "talk": {
      "title": "Creating games with physics in Flutter",
      "description": "",
      "lightening": false
    },
    "bio": "Programmer, backpacker, keyboard builder, climber and slightly more crazy than you are allowed to be."
  },
  {
    "id": "rihanna_kedir",
    "name": "Rihanna Kedir",
    "title": "",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/rihanna_ke",
      "github": "",
      "linkedin": "http://linkedin.com/in/rihanna-kedir-05068568"
    },
    "talk": {
      "title": "Leveraging Flutter for web support",
      "description": "In this talk we explore how to leverage Flutter Web to improve the experience of developers and users in the process of software delivery and onboarding.",
      "lightening": false,
      "coSpeaker": "juna_salviati"
    },
    "bio": "Rihanna is a Software Engineer and crafter. She is GDE in Web, Dart, and Flutter as well as a Women tech-makers ambassador and GDG lead. Rihanna strongly believes in the importance of sharing knowledge and experience; in her free time, she volunteers as a mentor and often organizes various tech events and meetups."
  },
  {
    "id": "aloos_deniel",
    "name": "Aloïs Deniel",
    "title": "",
    "company": "Freelance",
    "social": {
      "twitter": "https://twitter.com/aloisdeniel",
      "github": "https://github.com/aloisdeniel/",
      "linkedin": ""
    },
    "talk": {
      "title": "Building truly adaptative user interfaces",
      "description": "In this talk, I will cover various technics to help you design truly cross-platform user interfaces (adapt the interface to the screen size, accessibility, inputs) and how to test your app against all these constraints.",
      "lightening": false
    },
    "bio": "I am a french Flutter developer with far too many open source projects! I created tools to help with development cycle like device preview or flutter to figma."
  },
  {
    "id": "katarina_sheremet",
    "name": "Katarina Sheremet",
    "title": "",
    "company": "FutureWare",
    "social": {
      "twitter": "https://twitter.com/kate_sheremet",
      "github": "https://github.com/ksheremet",
      "linkedin": ""
    },
    "talk": {
      "title": "Effective Flutter Development",
      "description": "In this talk, we are going to discuss some practices, tips, and tools that will help you to write effective code even if you are a beginner and be more productive when developing apps using Flutter and Dart. This talk is suitable for all levels.",
      "lightening": false
    },
    "bio": "Katarina is Flutter Developer and Google Developer Expert in Flutter and Dart, WTM Switzerland co-organizer, and Flutter Zürich Meetup co-organizer. She runs her own company that is called FutureWare and works on her own projects. One of the projects is Delern Flashcards, which is published on Google Play and App Store and has more than 3000 installs. She also organizes events about technologies, gives talks, and writes articles about Flutter and Dart."
  },
  {
    "id": "dominik_roszkowski",
    "name": "Dominik Roszkowski",
    "title": "",
    "company": "DR Labs",
    "social": {
      "twitter": "https://twitter.com/OrestesGaolin",
      "github": "http://github.com/orestesgaolin",
      "linkedin": ""
    },
    "talk": {
      "title": "Understanding Navigator 2.0 in Flutter",
      "description": "Learn how to use new declarative Navigator 2.0 ",
      "lightening": false
    },
    "bio": "Dominik is experienced Flutter Developer eager to create beautiful apps for mobile and desktop. He's Google Developer Expert in Flutter, co-founder of Flutter Europe conference and Flutter Warsaw meetup. He is active speaker on local meetups and conferences and writes Flutter-related articles on his blog roszkowski.dev. He's been working as a deputy manager of PW-Sat2 student satellite project."
  },
  {
    "id": "juna_salviati",
    "name": "Juna Salviati",
    "title": "Software Engineer",
    "company": "",
    "social": {
      "twitter": "http://twitter.com/1littleendian",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Leveraging Flutter for web support",
      "description": "In this talk we explore how to leverage Flutter Web to improve the experience of developers and users in the process of software delivery and onboarding.",
      "lightening": false
    },
    "bio": "Juna has always been curious about technology and computers so she wrote her first line of code at 10 and graduated as a Software Engineer. She is GDGRome co-leader and Women Techmakers ambassador. She has always been cultivating a passion for classical studies and humanities and is fascinated by human-machine interaction."
  },
  {
    "id": "damodar_lohani",
    "name": "Damodar Lohani",
    "title": "",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/lohanidamodar",
      "github": "https://github.com/lohanidamodar",
      "linkedin": ""
    },
    "talk": {
      "title": "Dart Extension Methods in Flutter to Make Life Easier",
      "description": "Dart comes with an awesome language feature, extension methods. Extension methods allows us to add functionalities to existing libraries easily. So in this talk, we are going to explore how we can use extension methods to our benefit, based mostly in context of Flutter.",
      "lightening": true
    },
    "bio": "A professional Full-stack Developer, currently mostly involved in Flutter. Loves to connect and contribute in the community. Always learning and helping others learn."
  },
  {
    "id": "merve_arslan",
    "name": "Merve Arslan",
    "title": "Flutter Developer",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/arslannmrv",
      "github": "https://github.com/arslannmrv",
      "linkedin": ""
    },
    "talk": {
      "title": "Flutter & Rive : A Legendary Friendship",
      "description": "Rive is an important and powerful design tool, and a huge friend of Flutter developers! We will take a dive in Rive and it’s amazing features and small peek at the future of Rive, Rive 2 in 20 minutes.",
      "lightening": false
    },
    "bio": "My name is Merve Arslan. I am an organizer at GDG and WTM Eskisehir. I am a 23 years old freelance illustrator and Flutter developer. I have been working on Flutter for 2 and a half years. I started making speeches since I was studying at University.  I love combining my designs and Flutter."
  },
  {
    "id": "vladimir_ivanov",
    "name": "Vladimir Ivanov",
    "title": "",
    "company": "EPAM System",
    "social": {
      "twitter": "https://twitter.com/vvsevolodovich",
      "github": "https://github.com/vlivanov",
      "linkedin": ""
    },
    "talk": {
      "title": "Fried Bird: Preparing Flutter for the production usage",
      "description": "Flutter is a hyped and young technology. But there are a lot of nuances that cause great inconvenience in the process of use like configuration of analysis, code generation issues, several environments support and multimodule issues. I am going to show how to deal with those issues providing the ready to use receipts. ",
      "lightening": false
    },
    "bio": "I am a Solution Architect at EPAM Systems, designing Software Systems for living. I am a developer, passionate about Mobile technologies, Cloud platforms and System Design."
  },
  {
    "id": "ashita_prasad",
    "name": "Ashita Prasad",
    "title": "",
    "company": "Flutter Gems",
    "social": {
      "twitter": "https://twitter.com/ashitaprasad",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "A Flutter Developer's Journey: From Package Discovery to Publishing and Beyond",
      "description": "This talk will introduce upcoming Flutter developers to the current Flutter package landscape comprising 12,000+ packages and will cover some state-of-the-art methods which should be followed by them while searching for the right package for their Flutter apps and while publishing a new Flutter package to gain a wider adoption.",
      "lightening": true
    },
    "bio": "Ashita is a die hard Flutter Developer and creator of Flutter Gems (https://fluttergems.dev), a visual package discovery platform which is trusted by more than 15000 Flutter developers across the globe."
  },
  {
    "id": "robert_brunhage",
    "name": "Robert Brunhage",
    "title": "",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/robertbrunhage",
      "github": "https://github.com/RobertBrunhage",
      "linkedin": ""
    },
    "talk": {
      "title": "Flutter MVU architecture with a touch of C",
      "description": "Learn creating applications with the MVU arctictecture with Riverpod, StateNotifier and Hooks.",
      "lightening": false
    },
    "bio": "App developer who has been using and creating Flutter content for over two years."
  },
  {
    "id": "muhammed_salih_guler",
    "name": "Muhammed Salih Guler",
    "title": " Senior Mobile Engineer, Superlist",
    "company": "",
    "social": {
      "twitter": "https://twitter.com/salihgueler",
      "github": "https://github.com/salihgueler",
      "linkedin": ""
    },
    "talk": {
      "title": "How to add Flutter to your existing app",
      "description": "From the day that it's announced, Flutter is attracting so many developers from different backgrounds. It gives everyone a chance to build an application from a single codebase and deploy it to Android, iOS, Desktop, and Web. But not everyone is in the position to abandon an existing codebase and start from scratch. Luckily Flutter got you covered if you want some of the great Flutter features on your ongoing application. <br/>In this talk, we will have a look at how you can add Flutter to your ongoing project by showing a real-life example app with thousands of users and, we will talk about how you can rewrite your existing applications step by step with Flutter.",
      "lightening": false
    },
    "bio": "Salih is a Berlin based Android Engineer who is a Google Developer Expert for Flutter and Dart. He likes sharing his knowledge with the people by mentoring aspiring developers, blogging and talking at conferences."
  },
  {
    "id": "kevin_suhajda",
    "name": "Kevin Suhajda",
    "title": "Dev rel",
    "company": "CodeMagic",
    "social": {
      "twitter": "",
      "github": "",
      "linkedin": ""
    },
    "talk": {
      "title": "Flutter Productivity Tips with CI/CD",
      "description": "During our scheduled activity let's take a look at some productivity tips when working with configuration as code in .yaml files so you can reduce boilerplate and make the code more readable and reusable. Kevin Suhajda is our engineer that works closely with customers and sees a lot of complicated pipelines that he has learned to help optimise.",
      "lightening": true
    },
    "bio": "Kevin helps people discover the benefit of using Codemagic CI/CD for testing, building and distributing their mobile apps. He has worked as a sales engineer and mobile application developer and loves to find out how things work and solving technical problems. In his spare time he likes playing guitar and hiking."
  }
]